# FieldDomainPointsByParameter Properties

---
The FieldDomainPointsByParameter type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from FieldDomainPoints)
Top
#### Reference
FieldDomainPointsByParameter Class
Autodesk.Revit.DB.Analysis Namespace